# Starting with pandas

In [2]:
print("Pandas")

Pandas

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\juypternotebook\venv\lib\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in c:\juypternotebook\venv\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\juypternotebook\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\juypternotebook\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\juypternotebook\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\juypternotebook\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
!pip install pandas

Collecting pandas
  Using cached pandas-2.3.0-cp313-cp313-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.3.1-cp313-cp313-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\python\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.3.0-cp313-cp313-win_amd64.whl (11.0 MB)
Using cached numpy-2.3.1-cp313-cp313-win_amd64.whl (12.7 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.3.1 pandas-2.3.0 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

#key data structures :
 1 , series 
 2, dataframes

In [3]:
import pandas as pd

In [5]:
s = pd.Series([1,2,3,4,5] , index =['a', 'b', 'c', 'd', 'e'])

In [6]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
df = pd.DataFrame({"names" : ["Harry", "sampath", "karthik", 'suvam'] , "marks" : [100 , 89 , 90, 99] })

In [8]:
df

     names  marks
0    Harry    100
1  sampath     89
2  karthik     90
3    suvam     99

In [9]:
data =[["Ayesha", 22, "Mumbai"], ["Zain", 32, "Delhi"], ["Karan", 23 , "Banglore"]]
df= pd.DataFrame(data, columns=["Name", "Age", "City"], index= ["a", "b", "c"])

In [10]:
df

     Name  Age      City
a  Ayesha   22    Mumbai
b    Zain   32     Delhi
c   Karan   23  Banglore

In [11]:
data = [
    {'Name': 'Ayesha', 'Age': 22, 'City': 'Mumbai'},
    {'Name': 'Zain', 'Age': 25, 'City': 'Delhi'},
    {'Name': 'Karan', 'Age': 23, 'City': 'Bangalore'}
]
df = pd.DataFrame(data)

In [12]:
df

     Name  Age       City
0  Ayesha   22     Mumbai
1    Zain   25      Delhi
2   Karan   23  Bangalore

In [13]:
import numpy as np
arr = np.array([['Ayesha', 22, 'Mumbai'],
                ['Zain', 25, 'Delhi'],
                ['Karan', 23, 'Bangalore']])

df = pd.DataFrame(arr, columns=['Name', 'Age', 'City'])

In [14]:
df

     Name Age       City
0  Ayesha  22     Mumbai
1    Zain  25      Delhi
2   Karan  23  Bangalore

In [15]:
data

[{'Name': 'Ayesha', 'Age': 22, 'City': 'Mumbai'},
 {'Name': 'Zain', 'Age': 25, 'City': 'Delhi'},
 {'Name': 'Karan', 'Age': 23, 'City': 'Bangalore'}]

In [4]:
df = pd.read_csv("data/iris.csv")

In [17]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [18]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [10]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [11]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

Data Section

In [19]:
df["sepal_length"]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [20]:
type(df["sepal_length"])

pandas.core.series.Series

In [18]:
df[["sepal_length", "petal_length"]]

     sepal_length  petal_length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [20]:
type(df[["sepal_length", "petal_length" , "species"]])

pandas.core.frame.DataFrame

In [28]:
df.iloc[5] # gives specific row

sepal_length       5.4
sepal_width        3.9
petal_length       1.7
petal_width        0.4
species         setosa
Name: 5, dtype: object

In [30]:
df.iloc[0,0]

np.float64(5.1)

In [31]:
df.iloc[1]

sepal_length       4.9
sepal_width        3.0
petal_length       1.4
petal_width        0.2
species         setosa
Name: 1, dtype: object

In [32]:
df.iloc[:, 2]

0      1.4
1      1.4
2      1.3
3      1.5
4      1.4
      ...
145    5.2
146    5.0
147    5.2
148    5.4
149    5.1
Name: petal_length, Length: 150, dtype: float64

In [33]:
df.loc[4, "petal_length" ]

np.float64(1.4)

In [21]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [23]:
df.shape

(150, 5)

In [24]:
sl = df["sepal_length"]

In [25]:
sl

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [39]:
df.rename(columns={"sepal_length":"SL"})

      SL  sepal_width  petal_length  petal_width    species
0    5.1          3.5           1.4          0.2     setosa
1    4.9          3.0           1.4          0.2     setosa
2    4.7          3.2           1.3          0.2     setosa
3    4.6          3.1           1.5          0.2     setosa
4    5.0          3.6           1.4          0.2     setosa
..   ...          ...           ...          ...        ...
145  6.7          3.0           5.2          2.3  virginica
146  6.3          2.5           5.0          1.9  virginica
147  6.5          3.0           5.2          2.0  virginica
148  6.2          3.4           5.4          2.3  virginica
149  5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [5]:
df.rename(columns={"sepal_length":"SL"}, inplace= True)

In [37]:
df # real dataframe does not change

      SL  sepal_width  petal_length  petal_width    species
0    5.1          3.5           1.4          0.2     setosa
1    4.9          3.0           1.4          0.2     setosa
2    4.7          3.2           1.3          0.2     setosa
3    4.6          3.1           1.5          0.2     setosa
4    5.0          3.6           1.4          0.2     setosa
..   ...          ...           ...          ...        ...
145  6.7          3.0           5.2          2.3  virginica
146  6.3          2.5           5.0          1.9  virginica
147  6.5          3.0           5.2          2.0  virginica
148  6.2          3.4           5.4          2.3  virginica
149  5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [6]:
len(df)

150

In [7]:
df["zeros"] = [0 for i in range(len(df))] #add  a new column

In [42]:
df

      SL  sepal_width  petal_length  petal_width    species  zeros
0    5.1          3.5           1.4          0.2     setosa      0
1    4.9          3.0           1.4          0.2     setosa      0
2    4.7          3.2           1.3          0.2     setosa      0
3    4.6          3.1           1.5          0.2     setosa      0
4    5.0          3.6           1.4          0.2     setosa      0
..   ...          ...           ...          ...        ...    ...
145  6.7          3.0           5.2          2.3  virginica      0
146  6.3          2.5           5.0          1.9  virginica      0
147  6.5          3.0           5.2          2.0  virginica      0
148  6.2          3.4           5.4          2.3  virginica      0
149  5.9          3.0           5.1          1.8  virginica      0

[150 rows x 6 columns]

In [8]:
def fx(a):
    return a*a
df["new_column"] = df["petal_length"].apply(fx)

In [44]:
df

      SL  sepal_width  petal_length  petal_width    species  zeros  new_column
0    5.1          3.5           1.4          0.2     setosa      0        1.96
1    4.9          3.0           1.4          0.2     setosa      0        1.96
2    4.7          3.2           1.3          0.2     setosa      0        1.69
3    4.6          3.1           1.5          0.2     setosa      0        2.25
4    5.0          3.6           1.4          0.2     setosa      0        1.96
..   ...          ...           ...          ...        ...    ...         ...
145  6.7          3.0           5.2          2.3  virginica      0       27.04
146  6.3          2.5           5.0          1.9  virginica      0       25.00
147  6.5          3.0           5.2          2.0  virginica      0       27.04
148  6.2          3.4           5.4          2.3  virginica      0       29.16
149  5.9          3.0           5.1          1.8  virginica      0       26.01

[150 rows x 7 columns]

In [45]:
df.isnull()

        SL  sepal_width  petal_length  petal_width  species  zeros  new_column
0    False        False         False        False    False  False       False
1    False        False         False        False    False  False       False
2    False        False         False        False    False  False       False
3    False        False         False        False    False  False       False
4    False        False         False        False    False  False       False
..     ...          ...           ...          ...      ...    ...         ...
145  False        False         False        False    False  False       False
146  False        False         False        False    False  False       False
147  False        False         False        False    False  False       False
148  False        False         False        False    False  False       False
149  False        False         False        False    False  False       False

[150 rows x 7 columns]

In [9]:
df1 = pd.DataFrame({
    "name" : ["harry", "sampath","harish", "rohan", "diva", "khusi"],
    "marks" : [100 , 56, 90 , 78, 55, 78],
})

In [10]:
df1

      name  marks
0    harry    100
1  sampath     56
2   harish     90
3    rohan     78
4     diva     55
5    khusi     78

In [12]:
df2 = pd.DataFrame({
    "name" : ["anna", "arisu","rish", "ik"],
    "marks" : [ 90 , 78, 55, 78],
})

In [13]:
df2

    name  marks
0   anna     90
1  arisu     78
2   rish     55
3     ik     78

In [15]:
pd.concat([df1,df2])

      name  marks
0    harry    100
1  sampath     56
2   harish     90
3    rohan     78
4     diva     55
5    khusi     78
0     anna     90
1    arisu     78
2     rish     55
3       ik     78